In [2]:
import os
os.getcwd()

'C:\\Users\\ojaga\\Desktop\\Python Stuff'

In [3]:
import pandas as pd

In [4]:
movie = pd.read_csv("movies.csv")

In [5]:
len(movie)

559

In [6]:
movie.head(5)

,Film,Genre,Rotten Tomatoes Ratings %,Audience Ratings %,Budget (million $),Year of release
0,(500) Days of Summer,Comedy,87,81,8,2009
1,"10,000 B.C.",Adventure,9,44,105,2008
2,12 Rounds,Action,30,52,20,2009
3,127 Hours,Adventure,93,84,18,2010
4,17 Again,Comedy,55,70,20,2009

In [8]:
movie.tail(5)

,Film,Genre,Rotten Tomatoes Ratings %,Audience Ratings %,Budget (million $),Year of release
554,Your Highness,Comedy,26,36,50,2011
555,Youth in Revolt,Comedy,68,52,18,2009
556,Zodiac,Thriller,89,73,65,2007
557,Zombieland,Action,90,87,24,2009
558,Zookeeper,Comedy,14,42,80,2011

In [9]:
movie.columns

Index(['Film', 'Genre', 'Rotten Tomatoes Ratings %', 'Audience Ratings %',
       'Budget (million $)', 'Year of release'],
      dtype='object')

In [12]:
movie.columns = ['Film', 'Genre', 'CriticRatings', 'AudienceRatings',
       'Budgetmillion', 'Year']

In [13]:
movie.head(2)

,Film,Genre,CriticRatings,AudienceRatings,Budgetmillion,Year
0,(500) Days of Summer,Comedy,87,81,8,2009
1,"10,000 B.C.",Adventure,9,44,105,2008

In [15]:
movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 559 entries, 0 to 558
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Film             559 non-null    object
 1   Genre            559 non-null    object
 2   CriticRatings    559 non-null    int64
 3   AudienceRatings  559 non-null    int64
 4   Budgetmillion    559 non-null    int64
 5   Year             559 non-null    int64
dtypes: int64(4), object(2)
memory usage: 26.3+ KB

In [17]:
movie.describe()

       CriticRatings  AudienceRatings  Budgetmillion         Year
count     559.000000       559.000000     559.000000   559.000000
mean       47.309481        58.744186      50.236136  2009.152057
std        26.413091        16.826887      48.731817     1.362632
min         0.000000         0.000000       0.000000  2007.000000
25%        25.000000        47.000000      20.000000  2008.000000
50%        46.000000        58.000000      35.000000  2009.000000
75%        70.000000        72.000000      65.000000  2010.000000
max        97.000000        96.000000     300.000000  2011.000000

In [24]:
len(movie.columns)

6

In [25]:
movie.isnull()

      Film  Genre  CriticRatings  AudienceRatings  Budgetmillion   Year
0    False  False          False            False          False  False
1    False  False          False            False          False  False
2    False  False          False            False          False  False
3    False  False          False            False          False  False
4    False  False          False            False          False  False
..     ...    ...            ...              ...            ...    ...
554  False  False          False            False          False  False
555  False  False          False            False          False  False
556  False  False          False            False          False  False
557  False  False          False            False          False  False
558  False  False          False            False          False  False

[559 rows x 6 columns]

In [27]:
movie["Year"].head(5)

0    2009
1    2008
2    2009
3    2010
4    2009
Name: Year, dtype: int64

In [30]:
movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 559 entries, 0 to 558
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Film             559 non-null    object
 1   Genre            559 non-null    object
 2   CriticRatings    559 non-null    int64
 3   AudienceRatings  559 non-null    int64
 4   Budgetmillion    559 non-null    int64
 5   Year             559 non-null    int64
dtypes: int64(4), object(2)
memory usage: 26.3+ KB

In [28]:
movie.film = movie.Film.astype("category")

C:\Users\ojaga\AppData\Local\Temp\ipykernel_22088\1704796838.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  movie.film = movie.Film.astype("category")

In [34]:
movie['Film'] = movie['Film'].astype("category")

In [35]:
movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 559 entries, 0 to 558
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Film             559 non-null    category
 1   Genre            559 non-null    object
 2   CriticRatings    559 non-null    int64
 3   AudienceRatings  559 non-null    int64
 4   Budgetmillion    559 non-null    int64
 5   Year             559 non-null    int64
 6   film             559 non-null    category
dtypes: category(2), int64(4), object(1)
memory usage: 65.2+ KB

In [37]:
movie.head(0)

Empty DataFrame
Columns: [Film, Genre, CriticRatings, AudienceRatings, Budgetmillion, Year, film]
Index: []

In [38]:
movie['Genre'] = movie['Genre'].astype("category")
movie['Year'] = movie['Year'].astype("category")

In [39]:
movie.head(0)

Empty DataFrame
Columns: [Film, Genre, CriticRatings, AudienceRatings, Budgetmillion, Year, film]
Index: []

In [40]:
movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 559 entries, 0 to 558
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Film             559 non-null    category
 1   Genre            559 non-null    category
 2   CriticRatings    559 non-null    int64
 3   AudienceRatings  559 non-null    int64
 4   Budgetmillion    559 non-null    int64
 5   Year             559 non-null    category
 6   film             559 non-null    category
dtypes: category(4), int64(3)
memory usage: 58.1 KB

In [42]:
movie.Genre.cat.categories

Index(['Action', 'Adventure', 'Comedy', 'Drama', 'Horror', 'Romance',
       'Thriller'],
      dtype='object')

In [43]:
movie.describe()

       CriticRatings  AudienceRatings  Budgetmillion
count     559.000000       559.000000     559.000000
mean       47.309481        58.744186      50.236136
std        26.413091        16.826887      48.731817
min         0.000000         0.000000       0.000000
25%        25.000000        47.000000      20.000000
50%        46.000000        58.000000      35.000000
75%        70.000000        72.000000      65.000000
max        97.000000        96.000000     300.000000